In [1]:
import pymysql
pymysql.install_as_MySQLdb()
%load_ext sql
%config SqlMagic.autocommit=True
%sql mysql://root:simple@127.0.0.1

In [3]:
%%sql
use classicsales

 * mysql://root:***@127.0.0.1
0 rows affected.

[]

In [3]:
%%sql
show tables

 * mysql://root:***@127.0.0.1
9 rows affected.

[('customer',),
 ('employee',),
 ('office',),
 ('order',),
 ('order__item',),
 ('payment',),
 ('product',),
 ('product_line',),
 ('report',)]

In [18]:
%%sql
SELECT office.*,count(*) as number_of_employees from employee join office on employee.office_code=office.office_code
group by office.city

 * mysql://root:***@127.0.0.1
7 rows affected.

[('1', 'San Francisco', '+1 650 219 4782', '100 Market Street', 'Suite 300', 'CA', 'USA', '94080', 'NA', 6),
 ('2', 'Boston', '+1 215 837 0825', '1550 Court Place', 'Suite 102', 'MA', 'USA', '02107', 'NA', 2),
 ('3', 'NYC', '+1 212 555 3000', '523 East 53rd Street', 'apt. 5A', 'NY', 'USA', '10022', 'NA', 2),
 ('4', 'Paris', '+33 14 723 4404', "43 Rue Jouffroy D'abbans", None, None, 'France', '75017', 'EMEA', 5),
 ('5', 'Tokyo', '+81 33 224 5000', '4-1 Kioicho', None, 'Chiyoda-Ku', 'Japan', '102-8578', 'Japan', 2),
 ('6', 'Sydney', '+61 2 9264 2451', '5-11 Wentworth Avenue', 'Floor #2', None, 'Australia', 'NSW 2010', 'APAC', 4),
 ('7', 'London', '+44 20 7877 2041', '25 Old Broad Street', 'Level 7', None, 'UK', 'EC2N 1HN', 'EMEA', 2)]

In [29]:
%%sql
SELECT p1.*,count(*) as number_of_direct_reports FROM employee as p1 join report
join employee as p2 on p1.employee_number=report.employee_number and p2.employee_number=report.reports_to
group by p1.employee_number,report.reports_to

 * mysql://root:***@127.0.0.1
22 rows affected.

[(1056, 'Patterson', 'Mary', 'x4611', 'mpatterso@classicmodelcars.com', '1', 'VP Sales', 1),
 (1076, 'Firrelli', 'Jeff', 'x9273', 'jfirrelli@classicmodelcars.com', '1', 'VP Marketing', 1),
 (1088, 'Patterson', 'William', 'x4871', 'wpatterson@classicmodelcars.com', '6', 'Sales Manager (APAC)', 1),
 (1102, 'Bondur', 'Gerard', 'x5408', 'gbondur@classicmodelcars.com', '4', 'Sale Manager (EMEA)', 1),
 (1143, 'Bow', 'Anthony', 'x5428', 'abow@classicmodelcars.com', '1', 'Sales Manager (NA)', 1),
 (1621, 'Nishi', 'Mami', 'x101', 'mnishi@classicmodelcars.com', '5', 'Sales Rep', 1),
 (1611, 'Fixter', 'Andy', 'x101', 'afixter@classicmodelcars.com', '6', 'Sales Rep', 1),
 (1612, 'Marsh', 'Peter', 'x102', 'pmarsh@classicmodelcars.com', '6', 'Sales Rep', 1),
 (1619, 'King', 'Tom', 'x103', 'tking@classicmodelcars.com', '6', 'Sales Rep', 1),
 (1337, 'Bondur', 'Loui', 'x6493', 'lbondur@classicmodelcars.com', '4', 'Sales Rep', 1),
 (1370, 'Hernandez', 'Gerard', 'x2028', 'ghernande@classicmodelcars.com', '4', 'Sales Rep', 1),
 (1401, 'Castillo', 'Pamela', 'x2759', 'pcastillo@classicmodelcars.com', '4', 'Sales Rep', 1),
 (1501, 'Bott', 'Larry', 'x2311', 'lbott@classicmodelcars.com', '7', 'Sales Rep', 1),
 (1504, 'Jones', 'Barry', 'x102', 'bjones@classicmodelcars.com', '7', 'Sales Rep', 1),
 (1702, 'Gerard', 'Martin', 'x2312', 'mgerard@classicmodelcars.com', '4', 'Sales Rep', 1),
 (1165, 'Jennings', 'Leslie', 'x3291', 'ljennings@classicmodelcars.com', '1', 'Sales Rep', 1),
 (1166, 'Thompson', 'Leslie', 'x4065', 'lthompson@classicmodelcars.com', '1', 'Sales Rep', 1),
 (1188, 'Firrelli', 'Julie', 'x2173', 'jfirrelli@classicmodelcars.com', '2', 'Sales Rep', 1),
 (1216, 'Patterson', 'Steve', 'x4334', 'spatterson@classicmodelcars.com', '2', 'Sales Rep', 1),
 (1286, 'Tseng', 'Foon Yue', 'x2248', 'ftseng@classicmodelcars.com', '3', 'Sales Rep', 1),
 (1323, 'Vanauf', 'George', 'x4102', 'gvanauf@classicmodelcars.com', '3', 'Sales Rep', 1),
 (1625, 'Kato', 'Yoshimi', 'x102', 'ykato@classicmodelcars.com', '5', 'Sales Rep', 1)]

In [86]:
%%sql
SELECT sum(price) as total_price,product_line,count(*) as orders,month(order_date) as month_date FROM `order` natural join order__item natural join product
group by month_date
order by orders desc

 * mysql://root:***@127.0.0.1
12 rows affected.

[(Decimal('56163.59'), 'Classic Cars', 616, 11),
 (Decimal('29364.29'), 'Vintage Cars', 323, 10),
 (Decimal('23929.40'), 'Motorcycles', 261, 5),
 (Decimal('20694.41'), 'Classic Cars', 232, 3),
 (Decimal('20803.81'), 'Vintage Cars', 229, 1),
 (Decimal('20832.73'), 'Classic Cars', 226, 2),
 (Decimal('20159.01'), 'Vintage Cars', 224, 12),
 (Decimal('18013.48'), 'Classic Cars', 203, 4),
 (Decimal('17317.65'), 'Trucks and Buses', 191, 8),
 (Decimal('15620.17'), 'Motorcycles', 171, 9),
 (Decimal('15120.61'), 'Motorcycles', 165, 7),
 (Decimal('13926.27'), 'Classic Cars', 155, 6)]

In [29]:
%%sql
SELECT * from (
    select customer.*,month(payment_date) as month_date,sum(amount) as total_amount 
    from customer natural join payment
    group by (customer_number)) as w
Where month_date='11'
order by total_amount desc
limit 5

 * mysql://root:***@127.0.0.1
5 rows affected.

[(187, 'AV Stores, Co.', 'Ashworth', 'Rachel', '(171) 555-1555', 'Fauntleroy Circus', None, 'Manchester', None, 'EC2 5NT', 'UK', 1501, Decimal('136800.00'), 11, Decimal('148410.09')),
 (321, 'Corporate Gift Ideas Co.', 'Brown', 'Julie', '6505551386', '7734 Strong St.', None, 'San Francisco', 'CA', '94217', 'USA', 1165, Decimal('105000.00'), 11, Decimal('132340.78')),
 (119, 'La Rochelle Gifts', 'Labrune', 'Janine ', '40.67.8555', '67, rue des Cinquante Otages', None, 'Nantes', None, '44000', 'France', 1370, Decimal('118200.00'), 11, Decimal('116949.68')),
 (363, 'Online Diecast Creations Co.', 'Young', 'Dorothy', '6035558647', '2304 Long Airport Avenue', None, 'Nashua', 'NH', '62005', 'USA', 1216, Decimal('114200.00'), 11, Decimal('116449.29')),
 (458, 'Corrida Auto Replicas, Ltd', 'Sommer', 'Martín ', '(91) 555 22 82', 'C/ Araquil, 67', None, 'Madrid', None, '28023', 'Spain', 1702, Decimal('104600.00'), 11, Decimal('112440.09'))]

In [30]:
%%sql
use app

 * mysql://root:***@127.0.0.1
0 rows affected.

[]

In [31]:
%%sql
show tables

 * mysql://root:***@127.0.0.1
5 rows affected.

[('#add_on',), ('account',), ('credit_card',), ('purchase',), ('~log',)]

In [37]:
%%sql
SELECT addon_id,addon_name,count(*) as total_people_bought FROM purchase NATURAL JOIN `#add_on`
GROUP BY addon_id

 * mysql://root:***@127.0.0.1
3 rows affected.

[(1, 'Track & Field', 1664), (2, 'Marathon', 1666), (3, 'Sprint', 1670)]

In [3]:
%%sql
use classicsales

 * mysql://root:***@127.0.0.1
0 rows affected.

[]

In [3]:
%%sql
show tables

 * mysql://root:***@127.0.0.1
9 rows affected.

[('customer',),
 ('employee',),
 ('office',),
 ('order',),
 ('order__item',),
 ('payment',),
 ('product',),
 ('product_line',),
 ('report',)]

In [24]:
%%sql
select year(order_date) as current_year,r1.*,count(*) as number_sales,sum(price) as total_sales from employee as r1 join customer as r2 on r1.employee_number=r2.sales_rep natural join `order` natural join order__item
where year(order_date)='2005'
group by employee_number
order by total_sales desc
limit 5

 * mysql://root:***@127.0.0.1
5 rows affected.

[(2005, 1370, 'Hernandez', 'Gerard', 'x2028', 'ghernande@classicmodelcars.com', '4', 'Sales Rep', 127, Decimal('11149.47')),
 (2005, 1165, 'Jennings', 'Leslie', 'x3291', 'ljennings@classicmodelcars.com', '1', 'Sales Rep', 96, Decimal('9137.12')),
 (2005, 1612, 'Marsh', 'Peter', 'x102', 'pmarsh@classicmodelcars.com', '6', 'Sales Rep', 47, Decimal('4229.77')),
 (2005, 1501, 'Bott', 'Larry', 'x2311', 'lbott@classicmodelcars.com', '7', 'Sales Rep', 47, Decimal('4099.64')),
 (2005, 1401, 'Castillo', 'Pamela', 'x2759', 'pcastillo@classicmodelcars.com', '4', 'Sales Rep', 42, Decimal('3974.08'))]

In [2]:
%%sql
use nation

 * mysql://root:***@127.0.0.1
0 rows affected.

[]

In [3]:
%%sql
show tables

 * mysql://root:***@127.0.0.1
8 rows affected.

[('continents',),
 ('countries',),
 ('country_languages',),
 ('country_stats',),
 ('guests',),
 ('languages',),
 ('region_areas',),
 ('regions',)]

In [38]:
%%sql
SELECT language,count(name) as number_of_countries FROM languages natural join country_languages natural join countries 
group by language
order by number_of_countries desc
limit 5

 * mysql://root:***@127.0.0.1
5 rows affected.

[('English', 60),
 ('Arabic', 33),
 ('Spanish', 28),
 ('French', 25),
 ('German', 19)]

In [6]:
%%sql
SELECT year,sum(population) as world_population,sum(gdp) as world_gdp from countries natural join country_stats
where year = 2018

 * mysql://root:***@127.0.0.1
1 rows affected.

[(2018, Decimal('7358987174'), Decimal('83590040156453'))]

In [8]:
%%sql
SELECT year,sum(population) as world_population,sum(gdp) as world_gdp from countries natural join country_stats
group by year
order by year

 * mysql://root:***@127.0.0.1
59 rows affected.

[(1960, Decimal('2317935992'), Decimal('1118743000628')),
 (1961, Decimal('2364378686'), Decimal('1207075823880')),
 (1962, Decimal('2425978014'), Decimal('1320381474549')),
 (1963, Decimal('2478302324'), Decimal('1421729635563')),
 (1964, Decimal('2530841994'), Decimal('1557875653944')),
 (1965, Decimal('2619235221'), Decimal('1704098153376')),
 (1966, Decimal('2678118313'), Decimal('1848642377850')),
 (1967, Decimal('2847925779'), Decimal('1973083264695')),
 (1968, Decimal('2924291903'), Decimal('2135342222280')),
 (1969, Decimal('2990391069'), Decimal('2351180280031')),
 (1970, Decimal('3139461718'), Decimal('2780568237614')),
 (1971, Decimal('3209458112'), Decimal('3071111521053')),
 (1972, Decimal('3277719452'), Decimal('3541700567535')),
 (1973, Decimal('3344977921'), Decimal('4315738678586')),
 (1974, Decimal('3413144617'), Decimal('4975709725480')),
 (1975, Decimal('3473151657'), Decimal('5554874046743')),
 (1976, Decimal('3538665123'), Decimal('6042519670542')),
 (1977, Decimal('3603682280'), Decimal('6833786469960')),
 (1978, Decimal('3669444092'), Decimal('8044409572881')),
 (1979, Decimal('3737233268'), Decimal('9345097328096')),
 (1980, Decimal('3843161694'), Decimal('10678306772670')),
 (1981, Decimal('3951076212'), Decimal('11060513825737')),
 (1982, Decimal('4012475269'), Decimal('10953406180850')),
 (1983, Decimal('4087352589'), Decimal('11170875840453')),
 (1984, Decimal('4167968266'), Decimal('11581522639063')),
 (1985, Decimal('4305105219'), Decimal('12180861558858')),
 (1986, Decimal('4390194090'), Decimal('14392301386986')),
 (1987, Decimal('4527437484'), Decimal('16421120484297')),
 (1988, Decimal('4784007462'), Decimal('18927355419074')),
 (1989, Decimal('4869147803'), Decimal('19736253796020')),
 (1990, Decimal('5099990281'), Decimal('22505042391581')),
 (1991, Decimal('5113413199'), Decimal('23550852228522')),
 (1992, Decimal('5196145005'), Decimal('24972198267199')),
 (1993, Decimal('5346893709'), Decimal('25430442681870')),
 (1994, Decimal('5434510824'), Decimal('27314474000865')),
 (1995, Decimal('5532734143'), Decimal('30449041956687')),
 (1996, Decimal('5612919077'), Decimal('31114314300523')),
 (1997, Decimal('5692833896'), Decimal('30988159774617')),
 (1998, Decimal('5771952429'), Decimal('30943637387919')),
 (1999, Decimal('5849873355'), Decimal('32085437021961')),
 (2000, Decimal('5976444543'), Decimal('33128174554615')),
 (2001, Decimal('6053326335'), Decimal('32945078583978')),
 (2002, Decimal('6153148211'), Decimal('34223007114511')),
 (2003, Decimal('6230854449'), Decimal('38417526455764')),
 (2004, Decimal('6335425713'), Decimal('43303064427674')),
 (2005, Decimal('6414923611'), Decimal('46894074035954')),
 (2006, Decimal('6495117831'), Decimal('50830199606871')),
 (2007, Decimal('6575930835'), Decimal('57257797844936')),
 (2008, Decimal('6637399750'), Decimal('62791531544219')),
 (2009, Decimal('6718797596'), Decimal('59598461591794')),
 (2010, Decimal('6800219142'), Decimal('65238320326026')),
 (2011, Decimal('6880852124'), Decimal('72477162219588')),
 (2012, Decimal('6960473984'), Decimal('74175104239084')),
 (2013, Decimal('7057590477'), Decimal('76275187662055')),
 (2014, Decimal('7142758940'), Decimal('78346752313687')),
 (2015, Decimal('7198017302'), Decimal('73642726288557')),
 (2016, Decimal('7284132239'), Decimal('74726157289947')),
 (2017, Decimal('7369605751'), Decimal('79397294374660')),
 (2018, Decimal('7358987174'), Decimal('83590040156453'))]

In [20]:
%%sql
SELECT continents.name,sum(gdp)as total_gdp, sum(population) as total_population,year FROM continents join regions using(continent_id) join countries using(region_id) natural join country_stats
WHERE year=2018 
group by continent_id

 * mysql://root:***@127.0.0.1
6 rows affected.

[('North America', Decimal('23938266860018'), Decimal('569629826'), 2018),
 ('Asia', Decimal('30583328167746'), Decimal('4376908610'), 2018),
 ('Africa', Decimal('2335199629043'), Decimal('1259761667'), 2018),
 ('Europe', Decimal('21568321521665'), Decimal('717216719'), 2018),
 ('South America', Decimal('3493964579536'), Decimal('394528800'), 2018),
 ('Oceania', Decimal('1670959398445'), Decimal('40941552'), 2018)]

In [12]:
%%sql
SELECT countries.name,population,continents.name as continent,year FROM continents join regions using(continent_id) join countries using(region_id) natural join country_stats
WHERE year=2018 and continents.name="Africa"
having population>100000000

 * mysql://root:***@127.0.0.1
2 rows affected.

[('Ethiopia', 109224559, 'Africa', 2018),
 ('Nigeria', 195874740, 'Africa', 2018)]

In [34]:
%%sql
use university

 * mysql://root:***@127.0.0.1
0 rows affected.

[]

In [3]:
%%sql
show tables

 * mysql://root:***@127.0.0.1
11 rows affected.

[('course',),
 ('current_term',),
 ('department',),
 ('enroll',),
 ('grade',),
 ('letter_grade',),
 ('section',),
 ('student',),
 ('student_major',),
 ('term',),
 ('~log',)]

In [13]:
%%sql
SELECT dept,sum(student_id) as total_number_of_students from student natural join enroll
where dept='MATH'

 * mysql://root:***@127.0.0.1
1 rows affected.

[('MATH', Decimal('108035'))]

In [49]:
%%sql
select term_year,term,course_name, count(course) as enrollment from course natural join enroll natural join current_term
group by course
order by enrollment desc
limit 1

 * mysql://root:***@127.0.0.1
1 rows affected.

[(2018, 'Fall', 'Computer Systems', 11)]

In [2]:
%%sql
use hotel

 * mysql://root:***@127.0.0.1
0 rows affected.

[]

In [76]:
%%sql
show tables

 * mysql://root:***@127.0.0.1
7 rows affected.

[('check_in',),
 ('check_out',),
 ('guest',),
 ('reservation',),
 ('room',),
 ('room_available',),
 ('~log',)]

In [93]:
%%sql
select guest.*,count(check_in.date) as number_night from guest natural join reservation join check_in using(room)
group by guest_id
order by number_night desc
limit 5

 * mysql://root:***@127.0.0.1
5 rows affected.

[(800051627, 'Sean Lewis', 228),
 (3740092120, 'Amanda Torres', 217),
 (1248069892, 'Marc Durham', 207),
 (935563641, 'Frank Padilla', 201),
 (4196395460, 'Shawn Lester', 192)]

In [94]:
%%sql
use nation

 * mysql://root:***@127.0.0.1
0 rows affected.

[]

In [99]:
%%sql
SELECT regions.name, sum(gdp) / sum(population) as gdp_per_capita 
FROM regions JOIN countries using (region_id) NATURAL JOIN country_stats 
WHERE year=2018 GROUP BY region_id
ORDER BY gdp_per_capita DESC

 * mysql://root:***@127.0.0.1
23 rows affected.

[('North America', Decimal('60969.2672')),
 ('Nordic Countries', Decimal('60283.0448')),
 ('Australia and New Zealand', Decimal('54797.2481')),
 ('Western Europe', Decimal('48084.2176')),
 ('British Islands', Decimal('44961.9390')),
 ('Southern Europe', Decimal('28894.7823')),
 ('Baltic Countries', Decimal('19610.0947')),
 ('Eastern Asia', Decimal('13038.6653')),
 ('Middle East', Decimal('12796.6965')),
 ('Eastern Europe', Decimal('11054.7064')),
 ('South America', Decimal('8856.0444')),
 ('Central America', Decimal('8504.8136')),
 ('Caribbean', Decimal('7994.9232')),
 ('Southern Africa', Decimal('6221.5752')),
 ('Southeast Asia', Decimal('4540.4641')),
 ('Polynesia', Decimal('4357.4108')),
 ('Micronesia', Decimal('3682.2003')),
 ('Melanesia', Decimal('2990.8784')),
 ('Northern Africa', Decimal('2868.7577')),
 ('Southern and Central Asia', Decimal('1979.5632')),
 ('Western Africa', Decimal('1613.7979')),
 ('Central Africa', Decimal('1461.5715')),
 ('Eastern Africa', Decimal('945.5000'))]

In [100]:
%%sql
use classicsales

 * mysql://root:***@127.0.0.1
0 rows affected.

[]

In [101]:
%%sql
show tables

 * mysql://root:***@127.0.0.1
9 rows affected.

[('customer',),
 ('employee',),
 ('office',),
 ('order',),
 ('order__item',),
 ('payment',),
 ('product',),
 ('product_line',),
 ('report',)]

In [207]:
%%sql
select product.*, sum(price) as total_sales_dollars from  product natural join order__item
group by product_code
order by total_sales_dollars desc
limit 5

 * mysql://root:***@127.0.0.1
5 rows affected.

[('S18_3232', '1992 Ferrari 360 Spider red', 'Classic Cars', '1:18', 'Unimax Art Galleries', 'his replica features opening doors, superb detail and craftsmanship, working steering system, opening forward compartment, opening rear trunk with removable spare, 4 wheel independent spring suspension as well as factory baked enamel finish.', 8347, Decimal('77.90'), Decimal('169.34'), Decimal('8074.17')),
 ('S10_1949', '1952 Alpine Renault 1300', 'Classic Cars', '1:10', 'Classic Metal Creations', 'Turnable front wheels; steering function; detailed interior; detailed engine; opening hood; opening trunk; opening doors; and detailed chassis.', 7305, Decimal('98.58'), Decimal('214.30'), Decimal('5524.66')),
 ('S12_1108', '2001 Ferrari Enzo', 'Classic Cars', '1:12', 'Second Gear Diecast', 'Turnable front wheels; steering function; detailed interior; detailed engine; opening hood; opening trunk; opening doors; and detailed chassis.', 3619, Decimal('95.59'), Decimal('207.80'), Decimal('5051.61')),
 ('S10_4698', '2003 Harley-Davidson Eagle Drag Bike', 'Motorcycles', '1:10', 'Red Start Diecast', 'Model features, official Harley Davidson logos and insignias, detachable rear wheelie bar, heavy diecast metal with resin parts, authentic multi-colo ... (199 characters truncated) ... t replica, baked enamel finish, 1:10 scale model, removable fender, seat and tank cover piece for displaying the superior detail of the v-twin engine', 5582, Decimal('91.02'), Decimal('193.66'), Decimal('4824.07')),
 ('S12_1099', '1968 Ford Mustang', 'Classic Cars', '1:12', 'Autoart Studio Design', 'Hood, doors and trunk all open to reveal highly detailed interior features. Steering wheel actually turns the front wheels. Color dark green.', 68, Decimal('95.34'), Decimal('194.57'), Decimal('4656.05'))]

In [2]:
%%sql
use app

 * mysql://root:***@127.0.0.1
0 rows affected.

[]

In [3]:
%%sql
show tables

 * mysql://root:***@127.0.0.1
5 rows affected.

[('#add_on',), ('account',), ('credit_card',), ('purchase',), ('~log',)]

In [7]:
%%sql
SELECT p.purchase_date, SUM(ad.price) AS total_sales FROM `purchase` p JOIN `#add_on`ad ON p.addon_id = ad.addon_id
WHERE p.purchase_date >= CURDATE() - INTERVAL 1 MONTH and month(p.purchase_date)=11
GROUP BY p.purchase_date
ORDER BY total_sales DESC
LIMIT 10

 * mysql://root:***@127.0.0.1
10 rows affected.

[(datetime.date(2023, 11, 11), Decimal('8868.60')),
 (datetime.date(2023, 11, 1), Decimal('8801.38')),
 (datetime.date(2023, 11, 6), Decimal('8256.56')),
 (datetime.date(2023, 11, 7), Decimal('8179.16')),
 (datetime.date(2023, 11, 12), Decimal('8175.72')),
 (datetime.date(2023, 11, 8), Decimal('8051.17')),
 (datetime.date(2023, 11, 5), Decimal('7966.41')),
 (datetime.date(2023, 11, 3), Decimal('7855.98')),
 (datetime.date(2023, 11, 4), Decimal('7607.55')),
 (datetime.date(2023, 11, 9), Decimal('7561.90'))]

In [8]:
%%sql
use university

 * mysql://root:***@127.0.0.1
0 rows affected.

[]

In [9]:
%%sql
show tables

 * mysql://root:***@127.0.0.1
11 rows affected.

[('course',),
 ('current_term',),
 ('department',),
 ('enroll',),
 ('grade',),
 ('letter_grade',),
 ('section',),
 ('student',),
 ('student_major',),
 ('term',),
 ('~log',)]

In [18]:
%%sql
SELECT dept,count(*) as number_of_students FROM  student natural join student_major 
group by dept
limit 5

 * mysql://root:***@127.0.0.1
4 rows affected.

[('BIOL', 41), ('CS', 35), ('MATH', 31), ('PHYS', 32)]

In [34]:
%%sql
select term,term_year,dept,count(course) as number_of_courses from course natural join section natural join current_term
group by dept

 * mysql://root:***@127.0.0.1
4 rows affected.

[('Fall', 2018, 'BIOL', 17),
 ('Fall', 2018, 'CS', 10),
 ('Fall', 2018, 'MATH', 3),
 ('Fall', 2018, 'PHYS', 4)]

In [120]:
%%sql
select term_year,dept,count(student_id) as number_of_students from student natural join student_major natural join course natural join section  
where dept='MATH'
group by term_year
order by term_year

 * mysql://root:***@127.0.0.1
20 rows affected.

[(1999, 'MATH', 806),
 (2000, 'MATH', 837),
 (2001, 'MATH', 899),
 (2002, 'MATH', 434),
 (2003, 'MATH', 775),
 (2004, 'MATH', 620),
 (2005, 'MATH', 961),
 (2006, 'MATH', 868),
 (2007, 'MATH', 558),
 (2008, 'MATH', 775),
 (2009, 'MATH', 713),
 (2010, 'MATH', 682),
 (2011, 'MATH', 744),
 (2012, 'MATH', 682),
 (2013, 'MATH', 744),
 (2014, 'MATH', 775),
 (2015, 'MATH', 837),
 (2016, 'MATH', 1054),
 (2017, 'MATH', 620),
 (2018, 'MATH', 744)]

In [130]:
%%sql
select * from (select course.*,count(student_id) as number_of_students from enroll natural join student natural join student_major natural join course natural join section natural join current_term
group by course) as w
where number_of_students >=5

 * mysql://root:***@127.0.0.1
0 rows affected.

[]